In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
df = sns.load_dataset('iris')

In [3]:
df.shape

(150, 5)

In [5]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

### summarize data

In [7]:
#종류의 갯수를 세는 데 사용. (숫자보다는 오브젝트 컬럼 데이터 셋)
df['species'].value_counts()

virginica     50
setosa        50
versicolor    50
Name: species, dtype: int64

In [12]:
#컬럼 인덱스를 새로 지정하여서 자주 사용할 수 있음(조인의 개념)
pd.DataFrame(df['species'].value_counts())

            species
virginica        50
setosa           50
versicolor       50

In [14]:
len(df)

150

In [15]:
df.shape

(150, 5)

In [17]:
df.shape[0]

150

In [18]:
df.shape[1]

5

In [19]:
df['species'].nunique()

3

In [20]:
df['sepal_width'].nunique()

23

In [21]:
#통계의 기본 값을 보여줌
#수치에 대한 값을 보여줌으로 species 는 제외
#모두를 다 보고 싶은 경우 include='all'
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [22]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width    species
count     150.000000   150.000000    150.000000   150.000000        150
unique           NaN          NaN           NaN          NaN          3
top              NaN          NaN           NaN          NaN  virginica
freq             NaN          NaN           NaN          NaN         50
mean        5.843333     3.057333      3.758000     1.199333        NaN
std         0.828066     0.435866      1.765298     0.762238        NaN
min         4.300000     2.000000      1.000000     0.100000        NaN
25%         5.100000     2.800000      1.600000     0.300000        NaN
50%         5.800000     3.000000      4.350000     1.300000        NaN
75%         6.400000     3.300000      5.100000     1.800000        NaN
max         7.900000     4.400000      6.900000     2.500000        NaN

In [23]:
df.describe(include=['object'])

          species
count         150
unique          3
top     virginica
freq           50

In [24]:
df.describe(include=[np.object])

          species
count         150
unique          3
top     virginica
freq           50

In [25]:
df.describe(include=[np.number])

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [27]:
df['petal_width'].sum()

179.90000000000003

In [28]:
df['petal_width'].count()

150

In [29]:
#중간값
df['petal_width'].median()

1.3

In [30]:
#평균값
df['petal_width'].mean()

1.199333333333334

In [32]:
df['petal_width'].quantile([0.25,0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

In [34]:
df.quantile([0.25,0.75])

      sepal_length  sepal_width  petal_length  petal_width
0.25           5.1          2.8           1.6          0.3
0.75           6.4          3.3           5.1          1.8

In [35]:
df.min()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [36]:
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [39]:
#분산
df.var()

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [41]:
#표준편차
df.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

### apply(function)

In [44]:
# 람다 익명 함수 사용
# 전처리에 유용한 기능

df.apply(lambda x:x[1])

sepal_length       4.9
sepal_width          3
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [47]:
df['species_3'] = df['species'].apply(lambda x:x[3])

In [48]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species species_3
0           5.1          3.5           1.4          0.2  setosa         o
1           4.9          3.0           1.4          0.2  setosa         o
2           4.7          3.2           1.3          0.2  setosa         o
3           4.6          3.1           1.5          0.2  setosa         o
4           5.0          3.6           1.4          0.2  setosa         o

In [49]:
def smp(x):
    x = x[:-3]
    return x

In [50]:
df['species_4'] = df['species'].apply(smp)

In [51]:
df.head()

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species_4
0,5.1,3.5,1.4,0.2,setosa,o,set
1,4.9,3.0,1.4,0.2,setosa,o,set
2,4.7,3.2,1.3,0.2,setosa,o,set
3,4.6,3.1,1.5,0.2,setosa,o,set
4,5.0,3.6,1.4,0.2,setosa,o,set